In [57]:
import pandas as pd

In [58]:
import pandas as pd

df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 0 entries
Empty DataFrame

In [60]:
city = ['Berlin', 'Bangladesh', 'Australia']

In [61]:
city

['Berlin', 'Bangladesh', 'Australia']

In [62]:
df = pd.DataFrame(city)
print(df)

            0
0      Berlin
1  Bangladesh
2   Australia

In [63]:
type(df)

pandas.core.frame.DataFrame

In [64]:
type(city)

list

In [65]:
row, col = df.shape

In [66]:
row

3

In [67]:
col

1

In [68]:
df.shape

(3, 1)

In [69]:
df

            0
0      Berlin
1  Bangladesh
2   Australia

In [70]:
df = pd.DataFrame(city, columns=['city_in_europe'])
df

  city_in_europe
0         Berlin
1     Bangladesh
2      Australia

In [71]:
df = pd.DataFrame(city, columns=['city_in_europe'], index=['c1','c2','c3'])
df

   city_in_europe
c1         Berlin
c2     Bangladesh
c3      Australia

In [72]:
city2=['Dortmund','Paris','Madrid']
df2 = pd.DataFrame(zip(city,city2), columns=['city1','city2'])

In [73]:
df2

        city1     city2
0      Berlin  Dortmund
1  Bangladesh     Paris
2   Australia    Madrid

In [74]:
df2.shape

(3, 2)

In [75]:
city3=[('Modhumita','House Building'),('Tongi','Uttara'),('Dhaka','Bangladesh')]

In [76]:
city3

[('Modhumita', 'House Building'), ('Tongi', 'Uttara'), ('Dhaka', 'Bangladesh')]

In [77]:
df4 = pd.DataFrame(city3, columns=["State", "City"])

In [78]:
df4['Country'] = ['Bangladesh', 'Bangladesh', 'Bangladesh']

In [79]:
df4

       State            City     Country
0  Modhumita  House Building  Bangladesh
1      Tongi          Uttara  Bangladesh
2      Dhaka      Bangladesh  Bangladesh

In [80]:
city

['Berlin', 'Bangladesh', 'Australia']

In [81]:
city2

['Dortmund', 'Paris', 'Madrid']

In [82]:
dic1={
    'city1' : city,
    'city'  : city2
}

In [83]:
df5 = pd.DataFrame(dic1)

In [84]:
df5

        city1      city
0      Berlin  Dortmund
1  Bangladesh     Paris
2   Australia    Madrid

In [85]:
type(dic1)

dict

In [86]:
df = pd.read_csv('customers-100.csv')

In [87]:
df.head(7)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/
5,6,2d08FB17EE273F4,Aimee,Downs,Steele Group,Chavezborough,Bosnia and Herzegovina,(283)437-3886x88321,999-728-1637,louis27@gilbert.com,2020-02-25,http://www.berger.net/
6,7,EA4d384DfDbBf77,Darren,Peck,"Lester, Woodard and Mitchell",Lake Ana,Pitcairn Islands,(496)452-6181x3291,+1-247-266-0963x4995,tgates@cantrell.com,2021-08-24,https://www.le.com/

In [88]:
df.tail(6)

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
94,95,BE91A0bdcA49Bbc,Darrell,Douglas,"Newton, Petersen and Mathis",Daisyborough,Mali,001-084-845-9524x1777,001-769-564-6303,grayjean@lowery-good.com,2022-02-17,https://banks.biz/
95,96,cb8E23e48d22Eae,Karl,Greer,Carey LLC,East Richard,Guyana,(188)169-1674x58692,001-841-293-3519x614,hhart@jensen.com,2022-01-30,http://hayes-perez.com/
96,97,CeD220bdAaCfaDf,Lynn,Atkinson,"Ware, Burns and Oneal",New Bradview,Sri Lanka,+1-846-706-2218,605.413.3198,vkemp@ferrell.com,2021-07-10,https://novak-allison.com/
97,98,28CDbC0dFe4b1Db,Fred,Guerra,Schmitt-Jones,Ortegaland,Solomon Islands,+1-753-067-8419x7170,+1-632-666-7507x92121,swagner@kane.org,2021-09-18,https://www.ross.com/
98,99,c23d1D9EE8DEB0A,Yvonne,Farmer,Fitzgerald-Harrell,Lake Elijahview,Aruba,(530)311-9786,001-869-452-0943x12424,mccarthystephen@horn-green.biz,2021-08-11,http://watkins.info/
99,100,2354a0E336A91A1,Clarence,Haynes,"Le, Nash and Cross",Judymouth,Honduras,(753)813-6941,783.639.1472,colleen91@faulkner.biz,2020-03-11,http://www.hatfield-saunders.net/

In [89]:
print(df.values)

[[1 'DD37Cf93aecA6Dc' 'Sheryl' ... 'zunigavanessa@smith.info'
  '2020-08-24' 'http://www.stephenson.com/']
 [2 '1Ef7b82A4CAAD10' 'Preston' ... 'vmata@colon.com' '2021-04-23'
  'http://www.hobbs.com/']
 [3 '6F94879bDAfE5a6' 'Roy' ... 'beckycarr@hogan.com' '2020-03-25'
  'http://www.lawrence.com/']
 ...
 [98 '28CDbC0dFe4b1Db' 'Fred' ... 'swagner@kane.org' '2021-09-18'
  'https://www.ross.com/']
 [99 'c23d1D9EE8DEB0A' 'Yvonne' ... 'mccarthystephen@horn-green.biz'
  '2021-08-11' 'http://watkins.info/']
 [100 '2354a0E336A91A1' 'Clarence' ... 'colleen91@faulkner.biz'
  '2020-03-11' 'http://www.hatfield-saunders.net/']]

In [90]:
df.shape

(100, 12)

In [91]:
print(df.columns)

Index(['Index', 'Customer Id', 'First Name', 'Last Name', 'Company', 'City',
       'Country', 'Phone 1', 'Phone 2', 'Email', 'Subscription Date',
       'Website'],
      dtype='object')

In [92]:
print(df.index)

RangeIndex(start=0, stop=100, step=1)

In [93]:
data = {'date': ['2025-01-01', '2025-01-02', '2025-01-03']}

In [94]:
df = pd.DataFrame(data)

In [95]:
print(df.columns)

Index(['date'], dtype='object')

In [96]:
print(df['date'].head())

0    2025-01-01
1    2025-01-02
2    2025-01-03
Name: date, dtype: object

In [97]:
data = {'Customer Id ': [101, 102, 103], 'Name': ['Alice', 'Bob', 'Charlie']}
df = pd.DataFrame(data)

In [98]:
df.columns = df.columns.str.strip()

In [104]:
print(df[['Customer Id']])

   Customer Id
0          101
1          102
2          103

In [105]:
print(df['Customer Id'])

0    101
1    102
2    103
Name: Customer Id, dtype: int64